Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ32GB004.h
#define _PMADDR_CS_POSITION                      0x0000000E
#define _PMADDR_CS_MASK                          0x00004000
#define _PMADDR_CS_LENGTH                        0x00000001

#define _PMDOUT1_ADDR_POSITION                   0x00000000
#define _PMDOUT1_ADDR_MASK                       0x000007FF
#define _PMDOUT1_ADDR_LENGTH                     0x0000000B

#define _PMDOUT1_CS1_POSITION                    0x0000000E
#define _PMDOUT1_CS1_MASK                        0x00004000
#define _PMDOUT1_CS1_LENGTH                      0x00000001

#define _PMDOUT1_ADDR0_POSITION                  0x00000000
#define _PMDOUT1_ADDR0_MASK                      0x00000001
#define _PMDOUT1_ADDR0_LENGTH                    0x00000001

#define _PMDOUT1_ADDR1_POSITION                  0x00000001
#define _PMDOUT1_ADDR1_MASK                      0x00000002
#define _PMDOUT1_ADDR1_LENGTH                    0x00000001

#define _PMDOUT1_ADDR2_POSITION                  0x00000002
#define _PMDOUT1_ADDR2_MASK                      0x00000004
#define _PMDOUT1_ADDR2_LENGTH                    0x00000001

#define _PMDOUT1_ADDR3_POSITION                  0x00000003
#define _PMDOUT1_ADDR3_MASK                      0x00000008
#define _PMDOUT1_ADDR3_LENGTH                    0x00000001

#define _PMDOUT1_ADDR4_POSITION                  0x00000004
#define _PMDOUT1_ADDR4_MASK                      0x00000010
#define _PMDOUT1_ADDR4_LENGTH                    0x00000001

#define _PMDOUT1_ADDR5_POSITION                  0x00000005
#define _PMDOUT1_ADDR5_MASK                      0x00000020
#define _PMDOUT1_ADDR5_LENGTH                    0x00000001

#define _PMDOUT1_ADDR6_POSITION                  0x00000006
#define _PMDOUT1_ADDR6_MASK                      0x00000040
#define _PMDOUT1_ADDR6_LENGTH                    0x00000001

#define _PMDOUT1_ADDR7_POSITION                  0x00000007
#define _PMDOUT1_ADDR7_MASK                      0x00000080
#define _PMDOUT1_ADDR7_LENGTH                    0x00000001

#define _PMDOUT1_ADDR8_POSITION                  0x00000008
#define _PMDOUT1_ADDR8_MASK                      0x00000100
#define _PMDOUT1_ADDR8_LENGTH                    0x00000001

#define _PMDOUT1_ADDR9_POSITION                  0x00000009
#define _PMDOUT1_ADDR9_MASK                      0x00000200
#define _PMDOUT1_ADDR9_LENGTH                    0x00000001

#define _PMDOUT1_ADDR10_POSITION                 0x0000000A
#define _PMDOUT1_ADDR10_MASK                     0x00000400
#define _PMDOUT1_ADDR10_LENGTH                   0x00000001

#define _PMDOUT1_CS_POSITION                     0x0000000E
#define _PMDOUT1_CS_MASK                         0x00004000
#define _PMDOUT1_CS_LENGTH                       0x00000001

#define _PMAEN_PTEN_POSITION                     0x00000000
#define _PMAEN_PTEN_MASK                         0x000007FF
#define _PMAEN_PTEN_LENGTH                       0x0000000B

#define _PMAEN_PTEN14_POSITION                   0x0000000E
#define _PMAEN_PTEN14_MASK                       0x00004000
#define _PMAEN_PTEN14_LENGTH                     0x00000001

#define _PMAEN_PTEN0_POSITION                    0x00000000
#define _PMAEN_PTEN0_MASK                        0x00000001
#define _PMAEN_PTEN0_LENGTH                      0x00000001

#define _PMAEN_PTEN1_POSITION                    0x00000001
#define _PMAEN_PTEN1_MASK                        0x00000002
#define _PMAEN_PTEN1_LENGTH                      0x00000001

#define _PMAEN_PTEN2_POSITION                    0x00000002
#define _PMAEN_PTEN2_MASK                        0x00000004
#define _PMAEN_PTEN2_LENGTH                      0x00000001

#define _PMAEN_PTEN3_POSITION                    0x00000003
#define _PMAEN_PTEN3_MASK                        0x00000008
#define _PMAEN_PTEN3_LENGTH                      0x00000001

#define _PMAEN_PTEN4_POSITION                    0x00000004
#define _PMAEN_PTEN4_MASK                        0x00000010
#define _PMAEN_PTEN4_LENGTH                      0x00000001

#define _PMAEN_PTEN5_POSITION                    0x00000005
#define _PMAEN_PTEN5_MASK                        0x00000020
#define _PMAEN_PTEN5_LENGTH                      0x00000001

#define _PMAEN_PTEN6_POSITION                    0x00000006
#define _PMAEN_PTEN6_MASK                        0x00000040
#define _PMAEN_PTEN6_LENGTH                      0x00000001

#define _PMAEN_PTEN7_POSITION                    0x00000007
#define _PMAEN_PTEN7_MASK                        0x00000080
#define _PMAEN_PTEN7_LENGTH                      0x00000001

#define _PMAEN_PTEN8_POSITION                    0x00000008
#define _PMAEN_PTEN8_MASK                        0x00000100
#define _PMAEN_PTEN8_LENGTH                      0x00000001

#define _PMAEN_PTEN9_POSITION                    0x00000009
#define _PMAEN_PTEN9_MASK                        0x00000200
#define _PMAEN_PTEN9_LENGTH                      0x00000001

#define _PMAEN_PTEN10_POSITION                   0x0000000A
#define _PMAEN_PTEN10_MASK                       0x00000400
#define _PMAEN_PTEN10_LENGTH                     0x00000001

#define _PMSTAT_OB0E_POSITION                    0x00000000
#define _PMSTAT_OB0E_MASK                        0x00000001
#define _PMSTAT_OB0E_LENGTH                      0x00000001

#define _PMSTAT_OB1E_POSITION                    0x00000001
#define _PMSTAT_OB1E_MASK                        0x00000002
#define _PMSTAT_OB1E_LENGTH                      0x00000001

#define _PMSTAT_OB2E_POSITION                    0x00000002
#define _PMSTAT_OB2E_MASK                        0x00000004
#define _PMSTAT_OB2E_LENGTH                      0x00000001

#define _PMSTAT_OB3E_POSITION                    0x00000003
#define _PMSTAT_OB3E_MASK                        0x00000008
#define _PMSTAT_OB3E_LENGTH                      0x00000001

#define _PMSTAT_OBUF_POSITION                    0x00000006
#define _PMSTAT_OBUF_MASK                        0x00000040
#define _PMSTAT_OBUF_LENGTH                      0x00000001

#define _PMSTAT_OBE_POSITION                     0x00000007
#define _PMSTAT_OBE_MASK                         0x00000080
#define _PMSTAT_OBE_LENGTH                       0x00000001

#define _PMSTAT_IB0F_POSITION                    0x00000008
#define _PMSTAT_IB0F_MASK                        0x00000100
#define _PMSTAT_IB0F_LENGTH                      0x00000001

